УТ_для_edt/src/InformationRegisters/смартОчередьФормированияСкладскихОрдеров/смартОчередьФормированияСкладскихОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартОчередьФормированияСкладскихОрдеров</name>
  <comment>#5806 смарт: Тимофеева 26.02.26 / Перевод запчастей на серийный учет. Автоматизация создания ордеров для складов физлиц.</comment>
  <resources>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументСобытие</name>
    <type>
      <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      <types>DocumentRef.РасходныйОрдерНаТовары</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.СчетФактураВыданный</types>
      <types>DocumentRef.ПриходныйОрдерНаТовары</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Действие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартОчередьФормированияСкладскихОрдеров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьЗапись(ДокументОснование, ДокументСобытие, Действие, ОписаниеОшибки = "") Экспорт 
	МенеджерЗаписи = Регистрысведений.смартОчередьФормированияСкладскихОрдеров.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДокументОснование = ДокументОснование;
	МенеджерЗаписи.ДокументСобытие   = ДокументСобытие;
	МенеджерЗаписи.Действие          = Действие;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			МенеджерЗаписи.ДатаОбработки	  = ТекущаяДатаСеанса();
			МенеджерЗаписи.КоличествоПопыток  = МенеджерЗаписи.КоличествоПопыток + 1;
			МенеджерЗаписи.ОписаниеОшибки	  = ОписаниеОшибки;
	        МенеджерЗаписи.Записать();
		КонецЕсли;			
	Иначе
		МенеджерЗаписи.ДокументОснование = ДокументОснование;
		МенеджерЗаписи.ДокументСобытие   = ДокументСобытие;
		МенеджерЗаписи.Действие          = Действие;
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			МенеджерЗаписи.ДатаОбработки	  = ТекущаяДатаСеанса();
			МенеджерЗаписи.КоличествоПопыток  = 1;
			МенеджерЗаписи.ОписаниеОшибки	  = ОписаниеОшибки;
		КонецЕсли;	
		МенеджерЗаписи.Записать();
	КонецЕсли;
КонецПроцедуры 

Процедура УдалитьЗапись(СтруктураЗаписи) Экспорт 
	МенеджерЗаписи = Регистрысведений.смартОчередьФормированияСкладскихОрдеров.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураЗаписи); 
	МенеджерЗаписи.Удалить();
КонецПроцедуры

#КонецОбласти

///////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
